num_layers: 122
quant_type: SYMMETRIC
calib_type: PERTENSOR
layers {
  layer_name: "input"
  layer_type: "TIDL_DataLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 255
    size: 1
    element_type: 6
    scale: 1
    zero_point: 0
  }
}
layers {
  layer_name: "input_netFormat"
  layer_type: "TIDL_DataConvertLayer"
  bit_depth: 4
  outputs {
    min: 19.0000019
    max: 200
    size: 1
    element_type: 1
    scale: 0.5
    zero_point: 0
  }
}
layers {
  layer_name: "1"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: -25.4879646
    max: 29.6076851
    size: 1
    element_type: 1
    scale: 4.62831449508667
    zero_point: 4294967286
  }
  weights {
    min: -0.125187382
    max: 0.16017738
    size: 1
    element_type: 0
    scale: 799.11407470703125
    zero_point: 0
  }
  bias {
    min: -2.34817719
    max: 2.94677544
    size: 12
    element_type: 0
    scale: 43.437309265136719
    zero_point: 0
    value: -1.6849526166915894
    value: -2.3481771945953369
    value: 2.8563332557678223
    value: 1.8512520790100098
    value: 1.41533362865448
    value: -1.0686938762664795
    value: -2.1140236854553223
    value: 2.9467754364013672
    value: -0.25057479739189148
    value: 1.0384441614151
    value: 1.7116479873657227
    value: -0.23842015862464905
  }
}
layers {
  layer_name: "3"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 28.6560535
    size: 1
    element_type: 1
    scale: 8.8986434936523438
    zero_point: 4294967168
  }
  weights {
    min: -0.897738397
    max: 0.868470788
    size: 1
    element_type: 0
    scale: 142.58050537109375
    zero_point: 0
  }
  bias {
    min: -1.24210763
    max: 4.15486574
    size: 24
    element_type: 0
    scale: 30.807252883911133
    zero_point: 0
    value: -0.15558342635631561
    value: 0.2076297402381897
    value: 2.1365880966186523
    value: -0.27505093812942505
    value: 0.57505720853805542
    value: -0.50012832880020142
    value: 4.1548657417297363
    value: 0.44286167621612549
    value: -0.53000181913375854
    value: -0.25577667355537415
    value: 0.0141783207654953
    value: 1.0336791276931763
    value: 2.9921696186065674
    value: -0.19444181025028229
    value: 0.46558192372322083
    value: -0.50582629442214966
    value: 0.52892798185348511
    value: 2.8472511768341064
    value: -1.242107629776001
    value: 1.6890815496444702
    value: 0.64533448219299316
    value: 0.538454532623291
    value: 0.75677365064620972
    value: 0.2231544554233551
  }
}
layers {
  layer_name: "5"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 15.2500925
    size: 1
    element_type: 1
    scale: 16.721210479736328
    zero_point: 4294967168
  }
  weights {
    min: -0.432654202
    max: 0.23536703
    size: 1
    element_type: 0
    scale: 295.8482666015625
    zero_point: 0
  }
  bias {
    min: -2.40213966
    max: 4.4739542
    size: 48
    element_type: 0
    scale: 28.610038757324219
    zero_point: 0
    value: 0.42390874028205872
    value: 0.96479898691177368
    value: 1.2147016525268555
    value: 2.3167424201965332
    value: 0.68139111995697021
    value: 0.88829070329666138
    value: 0.49937519431114197
    value: 0.56082683801651
    value: 0.75389069318771362
    value: 0.62485772371292114
    value: -2.4021396636962891
    value: -0.18772074580192566
    value: 1.1402682065963745
    value: -0.15793922543525696
    value: -1.1352971792221069
    value: 0.74505710601806641
    value: 0.4444909393787384
    value: 1.8169853687286377
    value: -0.051932808011770248
    value: -1.016810417175293
    value: 1.5938884019851685
    value: 1.964652419090271
    value: 0.11188294738531113
    value: 0.33183303475379944
    value: 4.4739542007446289
    value: -0.0312114879488945
    value: 0.11248832195997238
    value: 1.2377527952194214
    value: -0.13746260106563568
    value: 0.62183189392089844
    value: 0.286283016204834
    value: 2.5958859920501709
    value: 4.1618289947509766
    value: 1.6838319301605225
    value: -0.35411491990089417
    value: 0.4211006760597229
    value: 1.1195954084396362
    value: 1.7031681537628174
    value: 1.5212147235870361
    value: 1.0192173719406128
    value: 0.096436098217964172
    value: 0.784927487373352
    value: -0.55437195301055908
    value: 0.081469669938087463
    value: 1.8629453182220459
    value: 1.6835072040557861
    value: 1.7671272754669189
    value: -0.060891948640346527
  }
}
layers {
  layer_name: "7"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 9.82679
    size: 1
    element_type: 0
    scale: 25.949470520019531
    zero_point: 0
  }
  weights {
    min: -1.22195876
    max: 0.75600177
    size: 1
    element_type: 0
    scale: 104.74985504150391
    zero_point: 0
  }
  bias {
    min: -1.4632355
    max: 3.45722628
    size: 24
    element_type: 0
    scale: 37.023899078369141
    zero_point: 0
    value: 1.3450566530227661
    value: -0.16099974513053894
    value: -0.32526159286499023
    value: 0.96185612678527832
    value: 0.22574377059936523
    value: 1.0420503616333008
    value: 3.4572262763977051
    value: 2.2946579456329346
    value: 0.2146679013967514
    value: 0.038684263825416565
    value: 0.21755851805210114
    value: 1.7404510974884033
    value: 3.2551352977752686
    value: 1.4191954135894775
    value: -0.74164968729019165
    value: 1.1591193675994873
    value: 1.0871331691741943
    value: -1.4632354974746704
    value: 0.1222316101193428
    value: 2.512617826461792
    value: 0.34276917576789856
    value: -1.0662535429000854
    value: -1.0020923614501953
    value: 2.1935381889343262
  }
}
layers {
  layer_name: "9"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 10.6693382
    size: 1
    element_type: 0
    scale: 23.900264739990234
    zero_point: 0
  }
  weights {
    min: -0.870673358
    max: 0.605676115
    size: 1
    element_type: 0
    scale: 147.01264953613281
    zero_point: 0
  }
  bias {
    min: 0.0271730535
    max: 4.09500122
    size: 24
    element_type: 0
    scale: 31.257621765136719
    zero_point: 0
    value: 0.18071739375591278
    value: 1.5990245342254639
    value: 1.1377290487289429
    value: 2.070216178894043
    value: 2.6681952476501465
    value: 1.4661861658096313
    value: 0.68019062280654907
    value: 0.38042694330215454
    value: 0.67630177736282349
    value: 0.90390557050704956
    value: 1.0266748666763306
    value: 2.2580225467681885
    value: 0.027173053473234177
    value: 0.91839021444320679
    value: 1.6835153102874756
    value: 4.095001220703125
    value: 2.6571717262268066
    value: 2.054429292678833
    value: 0.85161471366882324
    value: 0.25657430291175842
    value: 2.2853355407714844
    value: 1.15701162815094
    value: 1.5104697942733765
    value: 2.8639099597930908
  }
}
layers {
  layer_name: "11"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 7.67792892
    size: 1
    element_type: 1
    scale: 33.212081909179688
    zero_point: 4294967168
  }
  weights {
    min: -1.70044363
    max: 0.896115422
    size: 1
    element_type: 0
    scale: 75.27447509765625
    zero_point: 0
  }
  bias {
    min: -0.800683498
    max: 4.61058664
    size: 24
    element_type: 0
    scale: 27.76219367980957
    zero_point: 0
    value: 1.296328067779541
    value: 4.1978268623352051
    value: 0.26469108462333679
    value: 1.5000013113021851
    value: 2.4728615283966064
    value: 2.6281859874725342
    value: 3.9660682678222656
    value: -0.1678757518529892
    value: -0.61605072021484375
    value: 1.1943923234939575
    value: 4.1008739471435547
    value: -0.10479786992073059
    value: 3.1357479095458984
    value: 1.0829781293869019
    value: 4.6015949249267578
    value: -0.80068349838256836
    value: 3.1927371025085449
    value: 4.6105866432189941
    value: 0.882610023021698
    value: 3.4916150569915771
    value: 2.5787172317504883
    value: 1.5286698341369629
    value: 2.3604316711425781
    value: 0.91613441705703735
  }
}
layers {
  layer_name: "13"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 11.4279375
    size: 1
    element_type: 0
    scale: 22.313737869262695
    zero_point: 0
  }
  weights {
    min: -0.804030776
    max: 1.0347513
    size: 1
    element_type: 0
    scale: 123.70122528076172
    zero_point: 0
  }
  bias {
    min: -3.56685
    max: 8.66937256
    size: 24
    element_type: 0
    scale: 14.764620780944824
    zero_point: 0
    value: 0.43083348870277405
    value: 0.59637784957885742
    value: 1.5140513181686401
    value: -0.23668362200260162
    value: 1.0132808685302734
    value: 1.6580741405487061
    value: -0.32043036818504333
    value: -3.566849946975708
    value: 5.5455417633056641
    value: -0.51802349090576172
    value: 0.15270103514194489
    value: 1.5058097839355469
    value: -0.4727490246295929
    value: -1.0487643480300903
    value: 2.3372101783752441
    value: 2.2277145385742188
    value: 8.66937255859375
    value: 1.6070003509521484
    value: -0.68803846836090088
    value: 0.18802842497825623
    value: 1.6097334623336792
    value: -1.0980556011199951
    value: 0.23969629406929016
    value: 1.8076807260513306
  }
}
layers {
  layer_name: "14"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 15.7580853
    size: 1
    element_type: 0
    scale: 11.156868934631348
    zero_point: 0
  }
}
layers {
  layer_name: "15"
  layer_type: "TIDL_ConcatLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 15.7580853
    size: 1
    element_type: 0
    scale: 11.156868934631348
    zero_point: 0
  }
}
layers {
  layer_name: "17"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 12.2983017
    size: 1
    element_type: 1
    scale: 20.734569549560547
    zero_point: 4294967168
  }
  weights {
    min: -1.22078621
    max: 1.10888553
    size: 1
    element_type: 0
    scale: 104.8504638671875
    zero_point: 0
  }
  bias {
    min: -9.00140858
    max: 7.70578289
    size: 48
    element_type: 0
    scale: 14.219996452331543
    zero_point: 0
    value: 1.4381593465805054
    value: -1.1492913961410522
    value: 3.6712491512298584
    value: 1.1635252237319946
    value: -2.6833570003509521
    value: 1.8020796775817871
    value: 5.3718914985656738
    value: 4.537501335144043
    value: 2.3718981742858887
    value: 5.246849536895752
    value: -0.0938241183757782
    value: 1.4717381000518799
    value: 1.0242456197738647
    value: 0.43963932991027832
    value: 2.9815840721130371
    value: 7.7057828903198242
    value: 5.2236337661743164
    value: 3.9687137603759766
    value: 2.8944873809814453
    value: 3.3443012237548828
    value: 0.97086811065673828
    value: 0.508838415145874
    value: 0.64426589012146
    value: 4.0216426849365234
    value: 3.4636995792388916
    value: 0.29755902290344238
    value: 3.4727413654327393
    value: -0.062608145177364349
    value: -9.001408576965332
    value: -0.06311161071062088
    value: -1.72993803024292
    value: 5.1025967597961426
    value: -2.5347702503204346
    value: 4.6475305557250977
    value: -0.38681063055992126
    value: 1.9327799081802368
    value: 1.5181556940078735
    value: -0.65375465154647827
    value: 1.2085446119308472
    value: 2.6920821666717529
    value: -0.3808954656124115
    value: 0.70613420009613037
    value: -0.59762805700302124
    value: -0.028586935251951218
    value: 4.360292911529541
    value: -0.8528287410736084
    value: 4.3633060455322266
    value: -1.2556500434875488
  }
}
layers {
  layer_name: "19"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 10.7684984
    size: 1
    element_type: 1
    scale: 23.6801815032959
    zero_point: 4294967168
  }
  weights {
    min: -0.334986061
    max: 0.437746257
    size: 1
    element_type: 0
    scale: 292.40682983398438
    zero_point: 0
  }
  bias {
    min: -3.88385296
    max: 3.24715686
    size: 96
    element_type: 0
    scale: 32.956962585449219
    zero_point: 0
    value: 0.30350828170776367
    value: -0.18408350646495819
    value: 3.2471568584442139
    value: 0.00023788514954503626
    value: 0.74270695447921753
    value: 0.78090357780456543
    value: -0.023908596485853195
    value: 1.2118052244186401
    value: 0.95628350973129272
    value: 0.8589789867401123
    value: -0.0958578959107399
    value: 0.46538013219833374
    value: -0.20605206489562988
    value: 0.83398187160491943
    value: 0.77862548828125
    value: 0.22443805634975433
    value: 1.3230869770050049
    value: -0.53114992380142212
    value: -0.50057017803192139
    value: 0.28955015540122986
    value: -0.92841953039169312
    value: 0.43217074871063232
    value: -0.13671201467514038
    value: 0.21295903623104095
    value: 0.60749292373657227
    value: 0.026259202510118484
    value: 0.42970749735832214
    value: 0.89954984188079834
    value: 0.89224088191986084
    value: 1.2980887889862061
    value: 1.3213984966278076
    value: -0.44569453597068787
    value: 0.69762039184570312
    value: -0.31907138228416443
    value: -0.18199944496154785
    value: -1.37078857421875
    value: 0.358264297246933
    value: -0.14917445182800293
    value: 0.022864129394292831
    value: 1.3849058151245117
    value: -0.19691157341003418
    value: 0.48295199871063232
    value: 0.98889803886413574
    value: 0.13734625279903412
    value: 0.574024498462677
    value: 0.22826486825942993
    value: 1.6806513071060181
    value: 0.29064255952835083
    value: -3.8838529586791992
    value: 0.64060831069946289
    value: 0.35876736044883728
    value: 0.37217172980308533
    value: -0.17043814063072205
    value: 0.24337071180343628
    value: 0.68191814422607422
    value: -0.2331424355506897
    value: 0.86578941345214844
    value: 1.4262521266937256
    value: -0.3947833776473999
    value: 0.43706732988357544
    value: 0.80538153648376465
    value: -0.0683785006403923
    value: 0.67419904470443726
    value: 1.2559570074081421
    value: 0.20792385935783386
    value: 0.098403990268707275
    value: 1.5841162204742432
    value: 1.2198084592819214
    value: 1.0471335649490356
    value: -0.078696608543396
    value: 1.9943172931671143
    value: 0.26874741911888123
    value: 0.56020545959472656
    value: 0.48276269435882568
    value: -0.35321882367134094
    value: 1.3278738260269165
    value: 0.85613471269607544
    value: -0.0850328654050827
    value: 0.95562541484832764
    value: -0.16917672753334045
    value: 2.703216552734375
    value: 0.90210056304931641
    value: 0.55975544452667236
    value: 0.094881691038608551
    value: 0.19008879363536835
    value: 1.258126974105835
    value: 0.62933415174484253
    value: 1.3550589084625244
    value: 0.59115779399871826
    value: 0.84021198749542236
    value: -0.19094288349151611
    value: 0.18527579307556152
    value: 0.060867574065923691
    value: 1.53727126121521
    value: -0.67155832052230835
    value: -0.84045374393463135
  }
}
layers {
  layer_name: "21"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 10.7781477
    size: 1
    element_type: 0
    scale: 23.658981323242188
    zero_point: 0
  }
  weights {
    min: -1.30878031
    max: 1.24538386
    size: 1
    element_type: 0
    scale: 97.800979614257812
    zero_point: 0
  }
  bias {
    min: -2.96324611
    max: 4.30957842
    size: 48
    element_type: 0
    scale: 29.70128059387207
    zero_point: 0
    value: 2.626716136932373
    value: -1.431164026260376
    value: 3.6909501552581787
    value: 0.27954086661338806
    value: 4.3095784187316895
    value: 1.6379128694534302
    value: -1.0127050876617432
    value: -2.643782377243042
    value: -0.33226722478866577
    value: 1.1368932723999023
    value: 1.3161165714263916
    value: -2.9632461071014404
    value: 1.7336527109146118
    value: -0.24573825299739838
    value: 0.76461082696914673
    value: -0.77413028478622437
    value: -0.35535246133804321
    value: 2.1545209884643555
    value: 0.87485814094543457
    value: 0.30747818946838379
    value: 2.9180305004119873
    value: 0.363986998796463
    value: -0.40922769904136658
    value: 1.7661358118057251
    value: -0.014094669371843338
    value: 0.49104052782058716
    value: 3.0827150344848633
    value: -1.0427038669586182
    value: -0.122182697057724
    value: 0.96231341361999512
    value: 3.0605862140655518
    value: 0.67364150285720825
    value: 0.077284909784793854
    value: 0.14363546669483185
    value: 1.2702488899230957
    value: 0.58760255575180054
    value: 2.6702322959899902
    value: -2.1035048961639404
    value: 0.9464946985244751
    value: -0.6354491114616394
    value: 1.3507657051086426
    value: 1.6172497272491455
    value: -2.3410420417785645
    value: -0.91937196254730225
    value: -1.6571935415267944
    value: 2.0711150169372559
    value: 0.47268527746200562
    value: -1.3358368873596191
  }
}
layers {
  layer_name: "23"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 4.7638669
    size: 1
    element_type: 0
    scale: 53.5279426574707
    zero_point: 0
  }
  weights {
    min: -0.210680887
    max: 0.270144403
    size: 1
    element_type: 0
    scale: 473.82064819335938
    zero_point: 0
  }
  bias {
    min: -0.184487194
    max: 2.01134348
    size: 48
    element_type: 0
    scale: 63.639057159423828
    zero_point: 0
    value: 1.6957142353057861
    value: 0.50809752941131592
    value: -0.13238635659217834
    value: 0.82094371318817139
    value: 1.0538159608840942
    value: 0.25123965740203857
    value: 0.47872203588485718
    value: -0.10833478718996048
    value: 1.624178409576416
    value: 0.49496051669120789
    value: 1.4945287704467773
    value: 1.9079223871231079
    value: 0.28313827514648438
    value: 1.1344770193099976
    value: 0.23469655215740204
    value: 1.6295688152313232
    value: 2.0113434791564941
    value: 1.9898773431777954
    value: 0.65321904420852661
    value: 0.94330978393554688
    value: 0.13914443552494049
    value: 1.5101571083068848
    value: 0.30203959345817566
    value: 1.0773799419403076
    value: 1.9412590265274048
    value: 0.77754867076873779
    value: 0.73489099740982056
    value: 0.16780319809913635
    value: 0.31555637717247009
    value: 1.8661803007125854
    value: -0.18448719382286072
    value: 0.2184843122959137
    value: 0.92455774545669556
    value: 0.71089386940002441
    value: 0.557993471622467
    value: 0.69302284717559814
    value: 0.55797123908996582
    value: 0.93726652860641479
    value: 1.2767106294631958
    value: 0.40188005566596985
    value: 0.98878622055053711
    value: 1.3066266775131226
    value: 0.58898216485977173
    value: 0.86226427555084229
    value: 1.5956994295120239
    value: 0.027136873453855515
    value: 1.0259360074996948
    value: 0.34778973460197449
  }
}
layers {
  layer_name: "25"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 6.52839661
    size: 1
    element_type: 1
    scale: 39.060127258300781
    zero_point: 4294967168
  }
  weights {
    min: -1.42555606
    max: 1.5137763
    size: 1
    element_type: 0
    scale: 84.556747436523438
    zero_point: 0
  }
  bias {
    min: -5.59935141
    max: 3.79493833
    size: 48
    element_type: 0
    scale: 22.859790802001953
    zero_point: 0
    value: -0.45318296551704407
    value: 1.3221375942230225
    value: 2.7573757171630859
    value: -5.5993514060974121
    value: 0.82059371471405029
    value: -0.38224667310714722
    value: 1.3136123418807983
    value: 2.2399647235870361
    value: -0.7816200852394104
    value: -1.3247153759002686
    value: -1.0818530321121216
    value: 2.2826838493347168
    value: 2.7843811511993408
    value: 0.73907345533370972
    value: 1.1202868223190308
    value: -1.4790389537811279
    value: -2.9356656074523926
    value: 0.98429304361343384
    value: 1.3633245229721069
    value: -1.4444055557250977
    value: 1.7855892181396484
    value: -1.4874812364578247
    value: 2.5271413326263428
    value: -0.28413254022598267
    value: -0.80762052536010742
    value: 2.4939827919006348
    value: -2.1708760261535645
    value: -0.016921021044254303
    value: 0.37203007936477661
    value: -0.25780808925628662
    value: -1.3251041173934937
    value: -0.86461448669433594
    value: 2.2726519107818604
    value: 2.0222089290618896
    value: 0.54148232936859131
    value: -0.7328152060508728
    value: -1.7259403467178345
    value: -0.56574106216430664
    value: 1.0660092830657959
    value: -0.81430172920227051
    value: 0.642940878868103
    value: -0.94608044624328613
    value: -0.096880696713924408
    value: -0.78796929121017456
    value: 3.794938325881958
    value: 1.0876753330230713
    value: -1.2481820583343506
    value: -1.4479585886001587
  }
}
layers {
  layer_name: "27"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 5.06537914
    size: 1
    element_type: 0
    scale: 50.341739654541016
    zero_point: 0
  }
  weights {
    min: -0.355903864
    max: 0.305461258
    size: 1
    element_type: 0
    scale: 359.64767456054688
    zero_point: 0
  }
  bias {
    min: -0.839234173
    max: 2.81422281
    size: 48
    element_type: 0
    scale: 45.483249664306641
    zero_point: 0
    value: 0.0071051702834665775
    value: 0.2115500271320343
    value: 0.5743560791015625
    value: -0.12335173785686493
    value: -0.70957249402999878
    value: -0.24618837237358093
    value: -0.83923417329788208
    value: 0.32309061288833618
    value: 0.48894289135932922
    value: 0.61875826120376587
    value: 0.13432274758815765
    value: 0.11176019906997681
    value: -0.74497330188751221
    value: 0.59275710582733154
    value: 0.32468631863594055
    value: 0.034004952758550644
    value: 0.662634551525116
    value: 0.63362836837768555
    value: 0.352216511964798
    value: -0.20520937442779541
    value: 0.9197537899017334
    value: -0.22306732833385468
    value: 0.01589474081993103
    value: 0.43366715312004089
    value: 2.4215953350067139
    value: 0.57648766040802
    value: 0.343191534280777
    value: 0.37662726640701294
    value: 0.6549992561340332
    value: 1.2613065242767334
    value: 0.89099913835525513
    value: -0.28024831414222717
    value: -0.025188781321048737
    value: 0.10034167021512985
    value: 0.77053511142730713
    value: -0.24325384199619293
    value: 0.497770756483078
    value: 1.6413586139678955
    value: -0.40683555603027344
    value: 0.73357748985290527
    value: 2.8142228126525879
    value: -0.19607137143611908
    value: 0.24457955360412598
    value: 0.75592118501663208
    value: 0.1053125187754631
    value: -0.52506119012832642
    value: 0.080661453306674957
    value: 1.0910457372665405
  }
}
layers {
  layer_name: "28"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 6.67504311
    size: 1
    element_type: 0
    scale: 25.170869827270508
    zero_point: 0
  }
}
layers {
  layer_name: "30"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 7.2530961
    size: 1
    element_type: 1
    scale: 35.157398223876953
    zero_point: 4294967168
  }
  weights {
    min: -0.896861196
    max: 1.7196846
    size: 1
    element_type: 0
    scale: 74.4322509765625
    zero_point: 0
  }
  bias {
    min: -3.31551695
    max: 3.02555704
    size: 48
    element_type: 0
    scale: 38.606346130371094
    zero_point: 0
    value: 1.0236949920654297
    value: -1.2776694297790527
    value: 2.50569748878479
    value: 0.43948954343795776
    value: 0.45637026429176331
    value: 0.90327262878417969
    value: 1.5707321166992188
    value: -2.4954574108123779
    value: 1.1292458772659302
    value: -2.8850877285003662
    value: 1.0080044269561768
    value: 2.9000308513641357
    value: -0.11996334046125412
    value: -2.3818178176879883
    value: 1.0429670810699463
    value: 1.8459758758544922
    value: -1.1543625593185425
    value: 3.0255570411682129
    value: 1.2259418964385986
    value: -1.5135636329650879
    value: 0.70847147703170776
    value: -3.3155169486999512
    value: 1.657024621963501
    value: 2.5207028388977051
    value: -0.29816615581512451
    value: -0.7221643328666687
    value: 1.7608469724655151
    value: 0.53124058246612549
    value: 0.68651109933853149
    value: 1.9466608762741089
    value: -2.5593619346618652
    value: -0.0036130521912127733
    value: 0.56240040063858032
    value: 0.92282122373580933
    value: -0.066627047955989838
    value: 1.0178745985031128
    value: -0.36075398325920105
    value: -0.555633008480072
    value: 1.3566277027130127
    value: 0.4030584990978241
    value: -1.9759944677352905
    value: 1.248677134513855
    value: -1.4001578092575073
    value: -0.37823501229286194
    value: 1.2850669622421265
    value: 0.459917813539505
    value: 1.7975592613220215
    value: 2.9006509780883789
  }
}
layers {
  layer_name: "32"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 7.3386097
    size: 1
    element_type: 0
    scale: 34.747726440429688
    zero_point: 0
  }
  weights {
    min: -0.625466287
    max: 0.550399184
    size: 1
    element_type: 0
    scale: 204.64732360839844
    zero_point: 0
  }
  bias {
    min: -0.84749943
    max: 3.65086341
    size: 48
    element_type: 0
    scale: 35.060199737548828
    zero_point: 0
    value: 0.19089187681674957
    value: 0.20333082973957062
    value: 0.9283602237701416
    value: 0.912336528301239
    value: 0.11830348521471024
    value: 0.048648286610841751
    value: 0.02742062509059906
    value: 0.050048206001520157
    value: 0.6585235595703125
    value: 1.0805308818817139
    value: 1.3928029537200928
    value: 0.071573704481124878
    value: 0.31965693831443787
    value: -0.53769683837890625
    value: -0.847499430179596
    value: -0.501663327217102
    value: 0.61964303255081177
    value: 0.47260898351669312
    value: -0.020138418301939964
    value: 2.0548150539398193
    value: 2.1822388172149658
    value: 0.28386706113815308
    value: -0.072125189006328583
    value: 0.60362297296524048
    value: 3.6508634090423584
    value: 0.14492008090019226
    value: -0.26537162065505981
    value: 0.43812394142150879
    value: 1.8817125558853149
    value: -0.40634775161743164
    value: 0.44708803296089172
    value: 0.82897400856018066
    value: -0.31938266754150391
    value: 0.49387726187705994
    value: 0.6249205470085144
    value: 0.39311259984970093
    value: 1.5263434648513794
    value: 0.5513758659362793
    value: 0.9192347526550293
    value: -0.65731251239776611
    value: 1.5329282283782959
    value: 0.29429370164871216
    value: 0.38989359140396118
    value: 0.9028313159942627
    value: -0.36578443646430969
    value: 0.031064407899975777
    value: 0.37873148918151855
    value: 0.34211841225624084
  }
}
layers {
  layer_name: "33"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 9.88048458
    size: 1
    element_type: 0
    scale: 25.170869827270508
    zero_point: 0
  }
}
layers {
  layer_name: "35"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 9.15998
    size: 1
    element_type: 1
    scale: 27.838489532470703
    zero_point: 4294967168
  }
  weights {
    min: -0.807472885
    max: 1.14840436
    size: 1
    element_type: 0
    scale: 111.45899963378906
    zero_point: 0
  }
  bias {
    min: -1.79308558
    max: 3.32931089
    size: 48
    element_type: 0
    scale: 38.446395874023438
    zero_point: 0
    value: 1.3804374933242798
    value: 3.0941545963287354
    value: 0.46719318628311157
    value: 1.9059891700744629
    value: 2.2938880920410156
    value: -0.91444718837738037
    value: 0.39045929908752441
    value: -1.3014278411865234
    value: 0.34254181385040283
    value: 0.246388778090477
    value: 1.4366023540496826
    value: 1.3025351762771606
    value: -0.10791559517383575
    value: 2.087838888168335
    value: -0.62523549795150757
    value: -0.045412879437208176
    value: 3.3293108940124512
    value: -0.93522465229034424
    value: 0.15172453224658966
    value: -0.41838836669921875
    value: 0.66727548837661743
    value: -0.18749171495437622
    value: 1.3235260248184204
    value: 0.27182549238204956
    value: -0.078682765364646912
    value: 0.882056713104248
    value: 2.5457732677459717
    value: 0.48063531517982483
    value: 1.6980847120285034
    value: -1.3712227344512939
    value: 1.3195333480834961
    value: 0.49664855003356934
    value: 0.73212337493896484
    value: 1.843586802482605
    value: 0.95943969488143921
    value: 2.4255001544952393
    value: 0.54268878698349
    value: 1.021991491317749
    value: -1.7930855751037598
    value: -0.10657130181789398
    value: -1.5327824354171753
    value: 2.0446038246154785
    value: 1.7347160577774048
    value: -0.0309295691549778
    value: 0.87226074934005737
    value: 1.2240825891494751
    value: 0.45132750272750854
    value: 1.6912635564804077
  }
}
layers {
  layer_name: "37"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 12.8632278
    size: 1
    element_type: 0
    scale: 19.823951721191406
    zero_point: 0
  }
  weights {
    min: -0.672698
    max: 0.77290827
    size: 1
    element_type: 0
    scale: 165.60826110839844
    zero_point: 0
  }
  bias {
    min: -0.805367947
    max: 5.28690767
    size: 48
    element_type: 0
    scale: 24.210750579833984
    zero_point: 0
    value: 0.26934415102005005
    value: 2.06748104095459
    value: 0.41835257411003113
    value: 1.0728015899658203
    value: 1.2583682537078857
    value: -0.80536794662475586
    value: 1.1981790065765381
    value: -0.37621527910232544
    value: 3.0682940483093262
    value: -0.76481145620346069
    value: 1.2012225389480591
    value: -0.38276326656341553
    value: 0.74209189414978027
    value: 2.1088016033172607
    value: 1.1311663389205933
    value: 0.59423995018005371
    value: 0.36955216526985168
    value: 1.0867109298706055
    value: 1.1093157529830933
    value: 2.0291731357574463
    value: 0.030243854969739914
    value: 0.81692034006118774
    value: -0.15332736074924469
    value: 1.7090116739273071
    value: 5.28690767288208
    value: 1.6474279165267944
    value: 0.1587824672460556
    value: 0.10203403234481812
    value: 1.9298756122589111
    value: 0.065746329724788666
    value: -0.47424295544624329
    value: 1.5313999652862549
    value: -0.39859482645988464
    value: -0.1405147910118103
    value: 0.77545070648193359
    value: 1.8607034683227539
    value: 1.2483919858932495
    value: 3.4786629676818848
    value: 1.8313924074172974
    value: 0.1232779398560524
    value: 0.92571008205413818
    value: 0.62786155939102173
    value: 0.54488945007324219
    value: 1.5346660614013672
    value: 1.0588916540145874
    value: 1.334307074546814
    value: 0.9020841121673584
    value: 1.4108551740646362
  }
}
layers {
  layer_name: "38"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 17.2349892
    size: 1
    element_type: 0
    scale: 9.9119758605957031
    zero_point: 0
  }
}
layers {
  layer_name: "39"
  layer_type: "TIDL_ConcatLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 17.2349892
    size: 1
    element_type: 0
    scale: 9.9119758605957031
    zero_point: 0
  }
}
layers {
  layer_name: "41"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 6.64339399
    size: 1
    element_type: 0
    scale: 38.383995056152344
    zero_point: 0
  }
  weights {
    min: -0.380618304
    max: 0.546593606
    size: 1
    element_type: 0
    scale: 234.17764282226562
    zero_point: 0
  }
  bias {
    min: -2.84521437
    max: 3.55996943
    size: 96
    element_type: 0
    scale: 35.955364227294922
    zero_point: 0
    value: -0.4794902503490448
    value: 0.51762855052948
    value: -1.1645221710205078
    value: 0.38263607025146484
    value: 0.70746135711669922
    value: 2.3431077003479004
    value: 0.03568292036652565
    value: 0.11882639676332474
    value: -2.7124197483062744
    value: -0.508115828037262
    value: -0.27441588044166565
    value: -0.38709175586700439
    value: -0.66462075710296631
    value: -2.3403458595275879
    value: 0.7520439624786377
    value: 0.914184033870697
    value: -0.5409621000289917
    value: 1.1355074644088745
    value: 0.42999184131622314
    value: 1.3279167413711548
    value: 1.4591708183288574
    value: -0.24572798609733582
    value: -0.38968071341514587
    value: 0.37728708982467651
    value: -0.540866494178772
    value: -2.3130016326904297
    value: 0.53021317720413208
    value: -0.9599158763885498
    value: 1.1034971475601196
    value: 0.95262676477432251
    value: 1.5154801607131958
    value: 0.93702059984207153
    value: -1.3624272346496582
    value: 1.2593427896499634
    value: 1.2924011945724487
    value: 0.51827728748321533
    value: 1.4155932664871216
    value: 0.16010749340057373
    value: 0.46931833028793335
    value: 2.4062585830688477
    value: -0.75926917791366577
    value: 2.217658519744873
    value: 0.58034229278564453
    value: 3.559969425201416
    value: -1.1624969244003296
    value: 2.1071090698242188
    value: -0.35982710123062134
    value: 1.4573594331741333
    value: 0.42270645499229431
    value: 2.5786926746368408
    value: -0.2234543114900589
    value: 1.3653522729873657
    value: -0.17449741065502167
    value: -2.8452143669128418
    value: -1.8645861148834229
    value: -0.14447496831417084
    value: -0.71827584505081177
    value: 1.2076706886291504
    value: -0.43643507361412048
    value: 1.2792327404022217
    value: -1.5198984146118164
    value: -1.3927954435348511
    value: -1.6654728651046753
    value: 0.60379165410995483
    value: 2.0805299282073975
    value: -0.72201323509216309
    value: 0.57998621463775635
    value: 1.4723976850509644
    value: 0.077898494899272919
    value: 2.5580723285675049
    value: -0.085913099348545074
    value: 0.82195925712585449
    value: -1.3676269054412842
    value: -0.2999708354473114
    value: -0.48757702112197876
    value: 2.674468994140625
    value: -0.35303068161010742
    value: 1.6864439249038696
    value: 0.46245616674423218
    value: -1.23745596408844
    value: -0.30157783627510071
    value: -1.1644855737686157
    value: -0.31120365858078003
    value: 0.28538045287132263
    value: -0.57782226800918579
    value: -0.54206609725952148
    value: -0.16000926494598389
    value: 1.4233154058456421
    value: 0.74999916553497314
    value: -0.066774472594261169
    value: 0.76428693532943726
    value: -0.10145004093647003
    value: -0.15196922421455383
    value: 0.49687868356704712
    value: 2.2806453704833984
    value: -0.099915303289890289
  }
}
layers {
  layer_name: "43"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 6.91092634
    size: 1
    element_type: 1
    scale: 36.898094177246094
    zero_point: 4294967168
  }
  weights {
    min: -0.504341483
    max: 0.629230797
    size: 1
    element_type: 0
    scale: 203.4229736328125
    zero_point: 0
  }
  bias {
    min: -1.7145257
    max: 1.69644856
    size: 192
    element_type: 0
    scale: 74.656211853027344
    zero_point: 0
    value: 0.063601396977901459
    value: 0.82325726747512817
    value: -0.084891378879547119
    value: 0.77929413318634033
    value: -0.67459511756896973
    value: 1.6081527471542358
    value: -0.6339455246925354
    value: 0.0818571001291275
    value: -1.0182690620422363
    value: 0.34323403239250183
    value: -0.163604736328125
    value: -0.99299073219299316
    value: 0.43522623181343079
    value: 0.092525303363800049
    value: -1.0343780517578125
    value: -0.801443338394165
    value: -0.60697555541992188
    value: -0.22131170332431793
    value: -0.31446182727813721
    value: 0.8265576958656311
    value: -0.69953250885009766
    value: 1.2417575120925903
    value: -0.71676933765411377
    value: -1.1010702848434448
    value: -0.56971049308776855
    value: -1.1488763093948364
    value: 0.66678774356842041
    value: 0.51241803169250488
    value: -0.21192575991153717
    value: -0.21161761879920959
    value: 0.10056401044130325
    value: -0.093728303909301758
    value: -0.39203354716300964
    value: 1.3154504299163818
    value: 1.2173845767974854
    value: 0.0196822602301836
    value: 0.13994623720645905
    value: 0.37599065899848938
    value: -0.37573996186256409
    value: -0.55381792783737183
    value: 0.69447046518325806
    value: -0.49212983250617981
    value: -0.369137167930603
    value: -0.20189176499843597
    value: 0.347324937582016
    value: 0.035215809941291809
    value: -0.84994393587112427
    value: 0.17257152497768402
    value: 0.18303206562995911
    value: -1.5726640224456787
    value: -0.2639394998550415
    value: -0.52860742807388306
    value: -0.11530567705631256
    value: -1.0285552740097046
    value: -0.11196338385343552
    value: 0.12287694215774536
    value: -0.207890123128891
    value: 0.088887199759483337
    value: 1.2835251092910767
    value: 0.920909583568573
    value: 0.16423274576663971
    value: 0.76462149620056152
    value: 0.5654256939888
    value: -0.29316729307174683
    value: 0.038966018706560135
    value: 0.57745683193206787
    value: -0.28369846940040588
    value: -1.2087085247039795
    value: -0.23965734243392944
    value: -0.46792984008789062
    value: -0.14247190952301025
    value: -0.78084760904312134
    value: -0.12000076472759247
    value: -0.0465708002448082
    value: -0.73175203800201416
    value: -0.25991812348365784
    value: -0.051450073719024658
    value: -1.6649940013885498
    value: -0.66770094633102417
    value: 0.17748984694480896
    value: -0.31321588158607483
    value: -0.11735115200281143
    value: 0.29317408800125122
    value: 0.80460095405578613
    value: -0.28128769993782043
    value: 0.71548682451248169
    value: -0.40764439105987549
    value: -0.94711035490036011
    value: 0.026332328096032143
    value: -0.14761386811733246
    value: -0.56708210706710815
    value: 1.2255681753158569
    value: 0.10733408480882645
    value: 0.9118647575378418
    value: -0.43125122785568237
    value: -0.208174467086792
    value: -1.2689273357391357
    value: 0.75888293981552124
    value: -0.39340075850486755
    value: 0.089200600981712341
    value: 0.17467372119426727
    value: 0.23519587516784668
    value: -1.0232343673706055
    value: -0.46420425176620483
    value: -1.0834113359451294
    value: -0.884701669216156
    value: 0.97770208120346069
    value: 1.6530804634094238
    value: 0.12506338953971863
    value: -0.14289230108261108
    value: 1.6964485645294189
    value: -0.027009017765522003
    value: -1.4922792911529541
    value: -0.5429311990737915
    value: -0.61857873201370239
    value: -0.9919852614402771
    value: -1.1562038660049438
    value: -0.67500853538513184
    value: -0.0928613692522049
    value: 0.071268834173679352
    value: -0.70877134799957275
    value: 0.17921184003353119
    value: -1.1513340473175049
    value: -0.75885587930679321
    value: -0.27272346615791321
    value: 0.0064660161733627319
    value: 0.75945287942886353
    value: 0.0093535380437970161
    value: 0.17892040312290192
    value: 0.53229248523712158
    value: 0.46003079414367676
    value: -0.2677760124206543
    value: 0.88330018520355225
    value: 0.64815026521682739
    value: -0.13979001343250275
    value: -0.65891832113265991
    value: -0.70485818386077881
    value: -0.50763952732086182
    value: -1.0628527402877808
    value: 0.61287844181060791
    value: 0.18046398460865021
    value: -0.23938900232315063
    value: -0.81348991394042969
    value: -0.574699342250824
    value: -0.53392475843429565
    value: -0.84863775968551636
    value: -1.0558322668075562
    value: -1.5382633209228516
    value: -0.76606988906860352
    value: -0.16753560304641724
    value: -1.0380846261978149
    value: -0.60457247495651245
    value: -0.59120029211044312
    value: -0.080730892717838287
    value: -1.1219549179077148
    value: -0.61321020126342773
    value: -0.842381477355957
    value: -0.63030737638473511
    value: -0.19560301303863525
    value: -0.81636595726013184
    value: -0.67685198783874512
    value: 1.283103346824646
    value: 0.605830192565918
    value: 0.0024147392250597477
    value: -1.2744534015655518
    value: 0.1605718731880188
    value: -0.98159939050674438
    value: -0.23848001658916473
    value: -0.2730337381362915
    value: 0.36745229363441467
    value: -0.68374466896057129
    value: -1.7145256996154785
    value: 0.403158962726593
    value: 0.43391904234886169
    value: -0.93227040767669678
    value: 1.0942714214324951
    value: -0.2714989185333252
    value: -0.46983435750007629
    value: -0.023182990029454231
    value: -0.86990612745285034
    value: -0.23124444484710693
    value: 0.4996570348739624
    value: -0.7479245662689209
    value: 0.51131421327590942
    value: 0.507572591304779
    value: 1.0448744297027588
    value: 0.17269164323806763
    value: -0.22475437819957733
    value: 0.49141493439674377
    value: 0.0595981664955616
    value: 1.1492373943328857
    value: 0.0569615364074707
  }
}
layers {
  layer_name: "45"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 8.07789898
    size: 1
    element_type: 0
    scale: 31.56761360168457
    zero_point: 0
  }
  weights {
    min: -0.900251627
    max: 1.30431926
    size: 1
    element_type: 0
    scale: 98.135482788085938
    zero_point: 0
  }
  bias {
    min: -2.65741277
    max: 2.14109182
    size: 96
    element_type: 0
    scale: 48.167148590087891
    zero_point: 0
    value: 0.06588466465473175
    value: 1.4094874858856201
    value: -0.658842921257019
    value: 0.18792057037353516
    value: 2.0005073547363281
    value: -0.50446522235870361
    value: 0.30245071649551392
    value: 0.59401905536651611
    value: 0.21123848855495453
    value: 0.076880931854248047
    value: 0.33637699484825134
    value: 0.47275128960609436
    value: -0.50768911838531494
    value: 2.1410918235778809
    value: 0.91921043395996094
    value: 1.3094557523727417
    value: -0.20298533141613007
    value: 1.31217622756958
    value: 1.6245173215866089
    value: 1.0176525115966797
    value: 0.18286880850791931
    value: 0.43526667356491089
    value: -1.9867188930511475
    value: 0.28586944937705994
    value: 0.65869659185409546
    value: -2.6574127674102783
    value: -0.59358018636703491
    value: -0.058073699474334717
    value: 0.75236213207244873
    value: 1.1136778593063354
    value: -0.38692283630371094
    value: 0.27834439277648926
    value: -0.3085319995880127
    value: 2.1325585842132568
    value: 0.90304368734359741
    value: 0.11506668478250504
    value: 0.91269820928573608
    value: -0.51039963960647583
    value: 1.4831783771514893
    value: -0.88914448022842407
    value: 0.50526750087738037
    value: 0.7539404034614563
    value: 0.34981772303581238
    value: -0.71999907493591309
    value: 1.3585313558578491
    value: -0.11361978203058243
    value: 1.1784713268280029
    value: 0.17537392675876617
    value: 1.8048794269561768
    value: -1.1929736137390137
    value: 0.28567197918891907
    value: 0.85573285818099976
    value: -0.25164705514907837
    value: -0.29763504862785339
    value: 2.1191112995147705
    value: -0.47653365135192871
    value: 1.4307816028594971
    value: 1.5230756998062134
    value: -0.31819087266921997
    value: -1.5923601388931274
    value: -0.13872002065181732
    value: 0.24293534457683563
    value: 0.093165174126625061
    value: -0.38943725824356079
    value: 0.951262354850769
    value: 0.50465595722198486
    value: -0.26947727799415588
    value: -0.27437767386436462
    value: -0.4875800609588623
    value: -0.4135490357875824
    value: -1.0305676460266113
    value: 0.49418652057647705
    value: 0.51870530843734741
    value: 1.0871686935424805
    value: -1.4474304914474487
    value: 1.249664306640625
    value: 1.595892071723938
    value: -0.25585675239562988
    value: -0.30229872465133667
    value: -0.59688061475753784
    value: 1.11020827293396
    value: 0.94512379169464111
    value: 0.61887079477310181
    value: 1.8381602764129639
    value: 0.6431005597114563
    value: 0.078547343611717224
    value: 1.3304526805877686
    value: 0.67177343368530273
    value: -1.3609722852706909
    value: -0.30009004473686218
    value: -1.1287752389907837
    value: 0.39630264043807983
    value: 1.1098369359970093
    value: 0.777035653591156
    value: 0.01733175665140152
    value: -1.7482783794403076
  }
}
layers {
  layer_name: "47"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 3.42483211
    size: 1
    element_type: 0
    scale: 74.456207275390625
    zero_point: 0
  }
  weights {
    min: -0.250255793
    max: 0.555312395
    size: 1
    element_type: 0
    scale: 230.50088500976562
    zero_point: 0
  }
  bias {
    min: -0.932791471
    max: 1.18463957
    size: 96
    element_type: 0
    scale: 108.04974365234375
    zero_point: 0
    value: 0.54214704036712646
    value: 0.86487460136413574
    value: 0.34551301598548889
    value: 0.20009690523147583
    value: -0.11083666980266571
    value: 0.65856236219406128
    value: 0.42206349968910217
    value: 0.11304080486297607
    value: 0.69181877374649048
    value: 0.22833925485610962
    value: 0.024780541658401489
    value: 0.0095343813300132751
    value: 0.31816715002059937
    value: 0.74304693937301636
    value: 0.62645000219345093
    value: 0.10434295982122421
    value: 0.74732738733291626
    value: 0.19943428039550781
    value: 0.64768588542938232
    value: 0.24836762249469757
    value: 0.26727581024169922
    value: 0.44496357440948486
    value: -0.13039253652095795
    value: 0.1474108099937439
    value: 1.1423300504684448
    value: 0.3686835765838623
    value: 0.80639791488647461
    value: 0.13115017116069794
    value: 0.11685360223054886
    value: -0.27615129947662354
    value: -0.18435889482498169
    value: -0.14250540733337402
    value: 0.65080612897872925
    value: 0.50107800960540771
    value: 0.76398038864135742
    value: 0.47604465484619141
    value: -0.18540641665458679
    value: 0.2431146651506424
    value: -0.17445704340934753
    value: 0.20612700283527374
    value: -0.074570566415786743
    value: 0.410907506942749
    value: 0.25846374034881592
    value: 0.23930045962333679
    value: 0.08060840517282486
    value: -0.041848041117191315
    value: -0.076926790177822113
    value: 0.31331795454025269
    value: 0.0195162296295166
    value: 0.18637758493423462
    value: -0.18054771423339844
    value: 0.38313585519790649
    value: 0.34497135877609253
    value: 0.29127007722854614
    value: 0.15085124969482422
    value: 0.55583763122558594
    value: 0.055793661624193192
    value: -0.27998080849647522
    value: 0.572304368019104
    value: -0.0031791585497558117
    value: 0.61008983850479126
    value: 0.60808020830154419
    value: 0.3480144739151001
    value: -0.14689072966575623
    value: -0.93279147148132324
    value: -0.23317243158817291
    value: 0.43429693579673767
    value: -0.788165807723999
    value: 0.28948402404785156
    value: 0.0491812564432621
    value: 0.32049226760864258
    value: 0.041644908487796783
    value: 0.21336431801319122
    value: -0.20949400961399078
    value: 0.18870149552822113
    value: 0.043168302625417709
    value: 0.41788461804389954
    value: 0.37000173330307007
    value: -0.055401567369699478
    value: 0.1825067400932312
    value: 0.35304743051528931
    value: 0.98269915580749512
    value: 0.83420658111572266
    value: -0.11684980988502502
    value: 0.29659125208854675
    value: 0.12117854505777359
    value: -0.088431507349014282
    value: 0.42321303486824036
    value: 0.57663965225219727
    value: -0.4408525824546814
    value: -0.30437105894088745
    value: 0.12745948135852814
    value: 0.88466554880142212
    value: 0.17362497746944427
    value: 1.184639573097229
    value: 0.33933618664741516
  }
}
layers {
  layer_name: "49"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 5.55082321
    size: 1
    element_type: 1
    scale: 45.939132690429688
    zero_point: 4294967168
  }
  weights {
    min: -1.09486508
    max: 1.90196681
    size: 1
    element_type: 0
    scale: 67.298759460449219
    zero_point: 0
  }
  bias {
    min: -2.79910564
    max: 2.71402121
    size: 96
    element_type: 0
    scale: 45.7288932800293
    zero_point: 0
    value: 0.32265451550483704
    value: 0.29254713654518127
    value: 0.239524707198143
    value: 2.7140212059020996
    value: 0.10812971740961075
    value: 1.0368810892105103
    value: 1.0787824392318726
    value: -0.670629620552063
    value: 0.69077897071838379
    value: -1.5841622352600098
    value: -0.49613460898399353
    value: 0.28774780035018921
    value: -2.7991056442260742
    value: 1.2665822505950928
    value: 0.091899454593658447
    value: -0.21854634582996368
    value: 0.79427546262741089
    value: 1.3729637861251831
    value: 1.9136006832122803
    value: 1.2337014675140381
    value: -0.99576359987258911
    value: 1.3246792554855347
    value: 0.46878066658973694
    value: 2.6922926902770996
    value: 0.033056922256946564
    value: 1.4842789173126221
    value: 0.91169136762619019
    value: 0.45325544476509094
    value: 0.18615485727787018
    value: -0.016608182340860367
    value: 2.0043909549713135
