num_layers: 122
quant_type: SYMMETRIC
calib_type: PERTENSOR
layers {
  layer_name: "input"
  layer_type: "TIDL_DataLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 255
    size: 1
    element_type: 6
    scale: 1
    zero_point: 0
  }
}
layers {
  layer_name: "input_netFormat"
  layer_type: "TIDL_DataConvertLayer"
  bit_depth: 4
  outputs {
    min: 0
    max: 254.000015
    size: 1
    element_type: 1
    scale: 0.5
    zero_point: 0
  }
}
layers {
  layer_name: "1"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: -46.7269859
    max: 49.752861
    size: 1
    element_type: 1
    scale: 2.6430392265319824
    zero_point: 4294967292
  }
  weights {
    min: -0.172384799
    max: 0.228066966
    size: 1
    element_type: 0
    scale: 561.2386474609375
    zero_point: 0
  }
  bias {
    min: -9.82807541
    max: 7.56045151
    size: 12
    element_type: 0
    scale: 13.023913383483887
    zero_point: 0
    value: 3.6150288581848145
    value: 3.0501773357391357
    value: -9.8280754089355469
    value: 4.8318142890930176
    value: -4.5313472747802734
    value: 0.23135727643966675
    value: 4.8432812690734863
    value: 2.142214298248291
    value: 0.50808203220367432
    value: 7.5604515075683594
    value: -2.6725423336029053
    value: -7.1793274879455566
  }
}
layers {
  layer_name: "3"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 47.7741852
    size: 1
    element_type: 1
    scale: 5.3376107215881348
    zero_point: 4294967168
  }
  weights {
    min: -1.21640861
    max: 0.777828515
    size: 1
    element_type: 0
    scale: 105.22779846191406
    zero_point: 0
  }
  bias {
    min: -1.26359463
    max: 2.76873779
    size: 32
    element_type: 0
    scale: 46.230453491210938
    zero_point: 0
    value: 1.3690567016601562
    value: 0.34738153219223022
    value: 0.16732539236545563
    value: 0.946860671043396
    value: -0.098527811467647552
    value: 0.64766669273376465
    value: -0.031633060425519943
    value: -0.1668907105922699
    value: -0.071694068610668182
    value: 0.58602035045623779
    value: -0.33012402057647705
    value: -0.041577626019716263
    value: 0.45230668783187866
    value: 0.64221209287643433
    value: 0.34571185708045959
    value: -0.025197990238666534
    value: 0.050223845988512039
    value: -1.2635946273803711
    value: 0.069799892604351044
    value: 0.48347771167755127
    value: 2.76873779296875
    value: 0.11217009276151657
    value: 0.34380599856376648
    value: 2.145881175994873
    value: 1.6917705535888672
    value: 0.53521263599395752
    value: -0.23708274960517883
    value: -0.33135950565338135
    value: -0.20913979411125183
    value: 0.81163656711578369
    value: -0.067263692617416382
    value: 0.0701245591044426
  }
}
layers {
  layer_name: "5"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 33.6143608
    size: 1
    element_type: 1
    scale: 7.5860433578491211
    zero_point: 4294967168
  }
  weights {
    min: -0.493427157
    max: 0.365080893
    size: 1
    element_type: 0
    scale: 259.41012573242188
    zero_point: 0
  }
  bias {
    min: -3.24625826
    max: 4.34110689
    size: 64
    element_type: 0
    scale: 29.485567092895508
    zero_point: 0
    value: -0.44837570190429688
    value: 0.84974819421768188
    value: 2.154484748840332
    value: 0.79247009754180908
    value: 4.34110689163208
    value: -0.092042438685894012
    value: 1.4686713218688965
    value: 0.629164457321167
    value: 1.4186146259307861
    value: 1.2725070714950562
    value: 1.9698679447174072
    value: 0.41231727600097656
    value: 0.89685648679733276
    value: 0.67476671934127808
    value: 0.32800954580307007
    value: -0.39182561635971069
    value: 0.96614259481430054
    value: 1.6466801166534424
    value: 0.27378565073013306
    value: 0.26695933938026428
    value: 0.90074324607849121
    value: 0.83920073509216309
    value: 0.55627983808517456
    value: -1.5976827144622803
    value: 0.028439279645681381
    value: -0.63179469108581543
    value: -0.52189761400222778
    value: -0.14042575657367706
    value: -3.24625825881958
    value: 0.92185157537460327
    value: -0.39723771810531616
    value: 0.052460037171840668
    value: 1.6308052539825439
    value: 0.64156639575958252
    value: 2.5013229846954346
    value: -0.0040132892318069935
    value: 0.40981879830360413
    value: 1.0771374702453613
    value: -0.57957375049591064
    value: 1.0231232643127441
    value: 0.35470789670944214
    value: 3.8961811065673828
    value: 1.1736259460449219
    value: 1.8651498556137085
    value: 0.95050257444381714
    value: 0.71169930696487427
    value: 0.21316345036029816
    value: -0.57565093040466309
    value: 0.45351502299308777
    value: 0.34450235962867737
    value: 0.50738441944122314
    value: 1.1732032299041748
    value: 0.073855653405189514
    value: 1.0628945827484131
    value: 0.82494157552719116
    value: 1.1885793209075928
    value: 0.48424336314201355
    value: 0.51607471704483032
    value: 0.22432923316955566
    value: 0.034517452120780945
    value: 0.37442651391029358
    value: 0.24493718147277832
    value: 1.0544266700744629
    value: 0.88790327310562134
  }
}
layers {
  layer_name: "7"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 16.741291
    size: 1
    element_type: 0
    scale: 15.231800079345703
    zero_point: 0
  }
  weights {
    min: -1.39634728
    max: 0.856810033
    size: 1
    element_type: 0
    scale: 91.667739868164062
    zero_point: 0
  }
  bias {
    min: -0.729444623
    max: 2.48981404
    size: 32
    element_type: 0
    scale: 51.409461975097656
    zero_point: 0
    value: 1.2138851881027222
    value: 0.412560373544693
    value: 1.1482024192810059
    value: 0.30908450484275818
    value: 1.2563045024871826
    value: -0.11786375194787979
    value: -0.17032960057258606
    value: 0.45031258463859558
    value: 1.1923197507858276
    value: 1.539399266242981
    value: -0.39931964874267578
    value: 1.3792771100997925
    value: 1.5210249423980713
    value: -0.16228966414928436
    value: 2.433945894241333
    value: -0.72944462299346924
    value: 1.6653718948364258
    value: 1.5504673719406128
    value: -0.43306642770767212
    value: 2.0535819530487061
    value: 1.0205659866333008
    value: 1.2476603984832764
    value: 0.81882375478744507
    value: 1.8286173343658447
    value: 0.551362156867981
    value: 1.5640674829483032
    value: 0.95645415782928467
    value: 2.4898140430450439
    value: 0.85435450077056885
    value: 1.9518294334411621
    value: 0.11305010318756104
    value: 0.38338863849639893
  }
}
layers {
  layer_name: "9"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 9.91187859
    size: 1
    element_type: 0
    scale: 25.726707458496094
    zero_point: 0
  }
  weights {
    min: -0.761566162
    max: 0.420540959
    size: 1
    element_type: 0
    scale: 168.07469177246094
    zero_point: 0
  }
  bias {
    min: -0.399904609
    max: 2.98261619
    size: 32
    element_type: 0
    scale: 42.91534423828125
    zero_point: 0
    value: 0.23088473081588745
    value: 1.1039094924926758
    value: 1.0374679565429688
    value: 0.93115061521530151
    value: 1.1822034120559692
    value: 0.22857892513275146
    value: 2.1341798305511475
    value: 2.0472168922424316
    value: 0.24958914518356323
    value: 2.2863495349884033
    value: 1.6389796733856201
    value: -0.022380424663424492
    value: 0.42870545387268066
    value: 0.640562117099762
    value: 0.3588939905166626
    value: 0.58468377590179443
    value: 0.81944310665130615
    value: 0.81545495986938477
    value: 0.618425726890564
    value: 0.40051928162574768
    value: 0.82627922296524048
    value: 1.6206395626068115
    value: -0.39990460872650146
    value: 1.4836533069610596
    value: 1.1671191453933716
    value: 1.246404767036438
    value: 0.6572117805480957
    value: 2.6595141887664795
    value: 0.66644155979156494
    value: 0.6019253134727478
    value: 2.9826161861419678
    value: 1.2527968883514404
  }
}
layers {
  layer_name: "11"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 12.4913769
    size: 1
    element_type: 1
    scale: 20.414083480834961
    zero_point: 4294967168
  }
  weights {
    min: -1.47590744
    max: 2.53146911
    size: 1
    element_type: 0
    scale: 50.563526153564453
    zero_point: 0
  }
  bias {
    min: -2.66140246
    max: 4.07745409
    size: 32
    element_type: 0
    scale: 31.39213752746582
    zero_point: 0
    value: 4.0774540901184082
    value: 3.4008359909057617
    value: 1.834139347076416
    value: -1.3477060794830322
    value: 1.5295852422714233
    value: 1.8616780042648315
    value: -0.028983227908611298
    value: 3.6195456981658936
    value: -2.2418074607849121
    value: 2.7305140495300293
    value: -1.0212905406951904
    value: 3.2479934692382812
    value: -2.0158786773681641
    value: 1.1796059608459473
    value: 2.0339393615722656
    value: -2.6614024639129639
    value: 0.78886699676513672
    value: -1.857693076133728
    value: -0.29715520143508911
    value: -0.014929559081792831
    value: 0.75285691022872925
    value: 2.5454576015472412
    value: 3.67539644241333
    value: 0.70171332359313965
    value: 2.4599301815032959
    value: 0.61764985322952271
    value: 1.8981852531433105
    value: 1.5987417697906494
    value: -1.3078433275222778
    value: 3.731165885925293
    value: -0.82946527004241943
    value: 0.83942675590515137
  }
}
layers {
  layer_name: "13"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 16.4563103
    size: 1
    element_type: 0
    scale: 15.495575904846191
    zero_point: 0
  }
  weights {
    min: -1.85404134
    max: 1.00010657
    size: 1
    element_type: 0
    scale: 69.038375854492188
    zero_point: 0
  }
  bias {
    min: -3.79233
    max: 6.69800711
    size: 32
    element_type: 0
    scale: 19.110162734985352
    zero_point: 0
    value: 1.5784791707992554
    value: -1.2947239875793457
    value: 1.9862798452377319
    value: -0.29660093784332275
    value: -1.3239328861236572
    value: 2.9230780601501465
    value: 4.3820443153381348
    value: 3.6454586982727051
    value: 5.096682071685791
    value: 0.81593900918960571
    value: -0.62142819166183472
    value: 0.43094533681869507
    value: -1.4681804180145264
    value: -0.12833550572395325
    value: 1.2950055599212646
    value: 0.91636562347412109
    value: -0.2953701913356781
    value: -0.54247015714645386
    value: -0.405511736869812
    value: 2.3036479949951172
    value: 1.2374502420425415
    value: 6.6980071067810059
    value: -0.45995616912841797
    value: 3.3315441608428955
    value: 0.73438990116119385
    value: 0.64541018009185791
    value: 3.1171212196350098
    value: -0.42403885722160339
    value: -3.7923300266265869
    value: 0.36681655049324036
    value: 3.4412620067596436
    value: -2.0191876888275146
  }
}
layers {
  layer_name: "14"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 20.4087467
    size: 1
    element_type: 0
    scale: 7.7477879524230957
    zero_point: 0
  }
}
layers {
  layer_name: "15"
  layer_type: "TIDL_ConcatLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 20.5219498
    size: 1
    element_type: 0
    scale: 7.7477879524230957
    zero_point: 0
  }
}
layers {
  layer_name: "17"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 17.5026646
    size: 1
    element_type: 1
    scale: 14.569210052490234
    zero_point: 4294967168
  }
  weights {
    min: -0.893577278
    max: 1.55554318
    size: 1
    element_type: 0
    scale: 82.286369323730469
    zero_point: 0
  }
  bias {
    min: -2.9423964
    max: 6.27132654
    size: 64
    element_type: 0
    scale: 20.410354614257812
    zero_point: 0
    value: 2.2949535846710205
    value: 2.9588634967803955
    value: -0.25572025775909424
    value: 1.9400602579116821
    value: 0.80117946863174438
    value: 3.3752231597900391
    value: 0.80612385272979736
    value: -0.21942804753780365
    value: -0.033798806369304657
    value: -0.72048240900039673
    value: 0.11681975424289703
    value: -0.40601298213005066
    value: -1.0728574991226196
    value: -1.7018643617630005
    value: 0.55153757333755493
    value: 2.059093713760376
    value: -0.58826088905334473
    value: 1.3418352603912354
    value: -0.82679510116577148
    value: 1.1550874710083008
    value: 0.03958062082529068
    value: -0.837693452835083
    value: -0.66299480199813843
    value: 0.37752643227577209
    value: -0.40947410464286804
    value: 3.8609731197357178
    value: 2.2303581237792969
    value: 0.649364709854126
    value: 1.0114532709121704
    value: 1.0262846946716309
    value: 0.86879551410675049
    value: 2.5815315246582031
    value: 1.6371289491653442
    value: -1.6256915330886841
    value: -2.9423964023590088
    value: 0.49791145324707031
    value: -0.064318031072616577
    value: 1.9434483051300049
    value: 2.249061107635498
    value: 2.3432900905609131
    value: 1.6958949565887451
    value: 1.1300435066223145
    value: 4.221865177154541
    value: 1.3953964710235596
    value: 0.62234652042388916
    value: -0.77246886491775513
    value: 2.0757620334625244
    value: 6.2713265419006348
    value: -1.3048415184020996
    value: 3.0409178733825684
    value: 0.050639208406209946
    value: 3.5239880084991455
    value: 1.5779950618743896
    value: -0.31853175163269043
    value: 2.0618882179260254
    value: 0.81851822137832642
    value: 1.4361944198608398
    value: 0.097913146018981934
    value: 1.5072153806686401
    value: 0.051668327301740646
    value: -2.6713404655456543
    value: 0.3464958667755127
    value: 0.20997680723667145
    value: 2.1006135940551758
  }
}
layers {
  layer_name: "19"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 13.5566921
    size: 1
    element_type: 1
    scale: 18.809898376464844
    zero_point: 4294967168
  }
  weights {
    min: -0.489621192
    max: 0.622728
    size: 1
    element_type: 0
    scale: 205.54721069335938
    zero_point: 0
  }
  bias {
    min: -1.97599638
    max: 2.06190085
    size: 128
    element_type: 0
    scale: 62.078639984130859
    zero_point: 0
    value: 0.95917028188705444
    value: 0.82409626245498657
    value: 0.33105278015136719
    value: 0.96102303266525269
    value: -0.036379020661115646
    value: 0.51742881536483765
    value: 2.0442230701446533
    value: 1.1908961534500122
    value: -0.021058922633528709
    value: 0.69021540880203247
    value: 0.43590766191482544
    value: 0.69021517038345337
    value: 1.2123093605041504
    value: -1.530826210975647
    value: 0.83365994691848755
    value: -0.34472790360450745
    value: 0.16108162701129913
    value: 1.0782871246337891
    value: 1.2304301261901855
    value: 0.12780958414077759
    value: 0.68343138694763184
    value: 0.81755208969116211
    value: 0.21347472071647644
    value: 0.96710914373397827
    value: 0.86907953023910522
    value: 1.6692168712615967
    value: 0.61403828859329224
    value: 0.8610539436340332
    value: 0.98634815216064453
    value: 0.7080497145652771
    value: 0.2189011424779892
    value: -0.941798746585846
    value: -0.41653472185134888
    value: 1.1998054981231689
    value: 1.0326535701751709
    value: 0.85285860300064087
    value: 1.2464330196380615
    value: 0.922004759311676
    value: -0.73345065116882324
    value: -0.080701090395450592
    value: 0.38180267810821533
    value: 0.76629412174224854
    value: 1.4159579277038574
    value: 1.0803475379943848
    value: 0.503432035446167
    value: 0.79154360294342041
    value: -0.27352285385131836
    value: 1.2952910661697388
    value: -0.480903685092926
    value: 0.14373111724853516
    value: -1.2824447154998779
    value: 1.8693691492080688
    value: 0.50655460357666016
    value: 2.0168590545654297
    value: 0.58516925573349
    value: 1.2228916883468628
    value: 0.54494410753250122
    value: -0.18330654501914978
    value: 1.218849778175354
    value: -0.05942203477025032
    value: 1.4153695106506348
    value: 1.9827972650527954
    value: -0.2257440984249115
    value: 1.8754191398620605
    value: 1.3947322368621826
    value: 0.88354164361953735
    value: 1.1113415956497192
    value: 0.1444864422082901
    value: 0.76481473445892334
    value: 0.45421043038368225
    value: -0.49276173114776611
    value: 0.3867056667804718
    value: -0.318437397480011
    value: 1.0289100408554077
    value: -0.063327260315418243
    value: 0.19635416567325592
    value: -0.15055793523788452
    value: 2.0619008541107178
    value: 1.0270247459411621
    value: -0.27166152000427246
    value: -0.23022244870662689
    value: 0.6051369309425354
    value: 0.12408678978681564
    value: -0.05294572189450264
    value: 1.1473299264907837
    value: 0.95895612239837646
    value: -0.085994288325309753
    value: 0.17553067207336426
    value: 1.956424355506897
    value: -0.56397408246994019
    value: -1.4001563787460327
    value: 1.0924376249313354
    value: -0.94087070226669312
    value: 0.50269371271133423
    value: 0.66102558374404907
    value: 0.62277615070343018
    value: 0.045030523091554642
    value: -0.14066053926944733
    value: 1.0038740634918213
    value: 0.98058676719665527
    value: -0.270333856344223
    value: 1.3064033985137939
    value: 0.81575542688369751
    value: 0.32309859991073608
    value: 0.20087128877639771
    value: 0.21052996814250946
    value: 0.85632026195526123
    value: 1.1280988454818726
    value: 0.26093971729278564
    value: 1.1981689929962158
    value: -0.4504317045211792
    value: 0.68504846096038818
    value: 0.93923747539520264
    value: 1.31809663772583
    value: 1.4817898273468018
    value: 1.1053239107131958
    value: 1.6246784925460815
    value: 1.2199528217315674
    value: 0.49552369117736816
    value: 1.3594729900360107
    value: -0.11630815267562866
    value: 0.97673487663269043
    value: -0.19063402712345123
    value: -1.9759963750839233
    value: -0.626621663570404
    value: 0.14759980142116547
    value: 0.94185221195220947
    value: 1.2630997896194458
  }
}
layers {
  layer_name: "21"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 16.1056633
    size: 1
    element_type: 0
    scale: 15.832940101623535
    zero_point: 0
  }
  weights {
    min: -1.45036304
    max: 1.29454255
    size: 1
    element_type: 0
    scale: 88.253768920898438
    zero_point: 0
  }
  bias {
    min: -3.72163224
    max: 3.86499834
    size: 64
    element_type: 0
    scale: 33.11773681640625
    zero_point: 0
    value: -2.8519251346588135
    value: -0.47293677926063538
    value: 1.6892757415771484
    value: 1.1569733619689941
    value: -1.3865349292755127
    value: 2.4949204921722412
    value: 1.8111352920532227
    value: -1.6848055124282837
    value: 0.14083519577980042
    value: 0.71278649568557739
    value: 1.4171923398971558
    value: 1.0943150520324707
    value: -0.19769869744777679
    value: -1.0664001703262329
    value: 1.3237972259521484
    value: -1.1947944164276123
    value: 3.8649983406066895
    value: -0.065199986100196838
    value: 0.050085742026567459
    value: 1.9488657712936401
    value: -2.4009914398193359
    value: -0.860955536365509
    value: -0.49852436780929565
    value: 0.13839533925056458
    value: 0.03857085108757019
    value: 1.2585077285766602
    value: -1.9069803953170776
    value: 0.31709778308868408
    value: 0.89461606740951538
    value: 1.0282280445098877
    value: -2.9925124645233154
    value: 0.34865787625312805
    value: 0.01511750090867281
    value: 1.1525589227676392
    value: 1.376581072807312
    value: 1.5684711933135986
    value: 1.2999002933502197
    value: 0.38266265392303467
    value: 0.22811296582221985
    value: -1.2039344310760498
    value: -1.8347065448760986
    value: 0.73349136114120483
    value: 1.2440677881240845
    value: 0.47089001536369324
    value: 2.6443595886230469
    value: -0.58285105228424072
    value: 0.991239070892334
    value: 1.1256638765335083
    value: -0.83893221616745
    value: 1.4442722797393799
    value: 0.25389513373374939
    value: -3.7216322422027588
    value: -0.37469691038131714
    value: -1.2700085639953613
    value: -0.050077378749847412
    value: -0.79532796144485474
    value: 1.0854089260101318
    value: 2.2598135471343994
    value: 1.4431651830673218
    value: -0.2722189724445343
    value: -0.1007363349199295
    value: -0.86480671167373657
    value: 0.4760628342628479
    value: -0.36768659949302673
  }
}
layers {
  layer_name: "23"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 5.79623413
    size: 1
    element_type: 0
    scale: 43.994083404541016
    zero_point: 0
  }
  weights {
    min: -0.398693383
    max: 0.721689582
    size: 1
    element_type: 0
    scale: 177.361572265625
    zero_point: 0
  }
  bias {
    min: -0.650914431
    max: 3.32029462
    size: 64
    element_type: 0
    scale: 38.550796508789062
    zero_point: 0
    value: 0.73838382959365845
    value: 0.64380663633346558
    value: 0.22690366208553314
    value: -0.65091443061828613
    value: 0.31546470522880554
    value: 0.30699911713600159
    value: 1.2046558856964111
    value: 3.3202946186065674
    value: 1.2739102840423584
    value: 1.7932517528533936
    value: 0.7322155237197876
    value: 1.3898444175720215
    value: 0.3674837052822113
    value: 1.2624082565307617
    value: -0.0091928672045469284
    value: 0.089434415102005
    value: 0.893468976020813
    value: 0.22138063609600067
    value: 0.39372760057449341
    value: 0.83530235290527344
    value: 0.5944022536277771
    value: -0.08650633692741394
    value: 0.38651198148727417
    value: 0.076487332582473755
    value: 0.26832643151283264
    value: 1.0195279121398926
    value: 0.74224716424942017
    value: 0.73609602451324463
    value: -0.0088902823626995087
    value: 0.039537068456411362
    value: 1.5557622909545898
    value: 1.1271218061447144
    value: -0.019477952271699905
    value: 0.73616486787796021
    value: 1.3413093090057373
    value: 0.3044884204864502
    value: 1.2041301727294922
    value: 0.62873095273971558
    value: 0.50978595018386841
    value: 1.8240593671798706
    value: -0.064808130264282227
    value: 0.51077109575271606
    value: 1.0753408670425415
    value: 0.10397665947675705
    value: 1.6176247596740723
    value: 1.8487073183059692
    value: -0.38915020227432251
    value: 1.1599047183990479
    value: 1.0558125972747803
    value: 0.049253419041633606
    value: 0.8029327392578125
    value: 0.82798087596893311
    value: -0.085002809762954712
    value: 0.78280925750732422
    value: 0.063987918198108673
    value: -0.14729326963424683
    value: 1.2004355192184448
    value: 0.656609296798706
    value: 0.97710573673248291
    value: 1.5443164110183716
    value: 0.63709747791290283
    value: 0.25914481282234192
    value: 2.1566121578216553
    value: 0.27049899101257324
  }
}
layers {
  layer_name: "25"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 9.79432297
    size: 1
    element_type: 1
    scale: 26.035490036010742
    zero_point: 4294967168
  }
  weights {
    min: -1.59879148
    max: 1.46416306
    size: 1
    element_type: 0
    scale: 80.060470581054688
    zero_point: 0
  }
  bias {
    min: -4.59108496
    max: 4.5857954
    size: 64
    element_type: 0
    scale: 27.880119323730469
    zero_point: 0
    value: 1.915153980255127
    value: -1.3219349384307861
    value: 1.2634224891662598
    value: -1.2370424270629883
    value: -2.1602318286895752
    value: -1.4533889293670654
    value: -2.1935899257659912
    value: -0.50807356834411621
    value: -1.3310868740081787
    value: -1.6712555885314941
    value: 1.9760996103286743
    value: 1.0911433696746826
    value: 1.4497212171554565
    value: -0.075475417077541351
    value: -0.66271036863327026
    value: -2.9579613208770752
    value: 1.0960969924926758
    value: -0.20483309030532837
    value: 3.4733898639678955
    value: -3.8907475471496582
    value: -3.2517905235290527
    value: 1.8776786327362061
    value: 1.1456218957901
    value: 0.64843815565109253
    value: 0.72072505950927734
    value: 1.1208162307739258
    value: 0.89189088344573975
    value: -2.064532995223999
    value: -0.45383873581886292
    value: -4.5910849571228027
    value: 1.9056386947631836
    value: -3.0408198833465576
    value: 1.3296316862106323
    value: 1.3364510536193848
    value: 0.42544296383857727
    value: 0.50776779651641846
    value: -1.5181941986083984
    value: 0.87466180324554443
    value: -1.7770000696182251
    value: 3.2408580780029297
    value: 0.27176293730735779
    value: 1.7351702451705933
    value: 1.6090432405471802
    value: 0.47191515564918518
    value: 1.1968457698822021
    value: -3.2990958690643311
    value: 1.8604501485824585
    value: -1.1593899726867676
    value: 4.5857954025268555
    value: 0.27801400423049927
    value: 1.1208240985870361
    value: 0.66885584592819214
    value: 1.2857985496520996
    value: 2.5364508628845215
    value: -2.5457825660705566
    value: -2.1501567363739014
    value: 0.86819308996200562
    value: 0.57839608192443848
    value: -1.8983422517776489
    value: 1.2506147623062134
    value: 0.82448267936706543
    value: -0.74770009517669678
    value: 0.041149254888296127
    value: -0.27019724249839783
  }
}
layers {
  layer_name: "27"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 7.00302792
    size: 1
    element_type: 0
    scale: 36.412818908691406
    zero_point: 0
  }
  weights {
    min: -0.501326621
    max: 0.444295943
    size: 1
    element_type: 0
    scale: 255.32257080078125
    zero_point: 0
  }
  bias {
    min: -1.03875232
    max: 3.29443717
    size: 64
    element_type: 0
    scale: 38.853374481201172
    zero_point: 0
    value: 0.080445423722267151
    value: -0.11550191044807434
    value: 0.19869145750999451
    value: -0.62178629636764526
    value: -0.10277341306209564
    value: 0.38647863268852234
    value: 0.89914596080780029
    value: -1.0387523174285889
    value: -0.073681913316249847
    value: 0.20460191369056702
    value: -0.172626331448555
    value: 0.58223885297775269
    value: 0.26788392663002014
    value: 0.66552001237869263
    value: -0.46868085861206055
    value: 0.15974965691566467
    value: 0.77576792240142822
    value: -0.29724806547164917
    value: 0.041525375097990036
    value: -0.89011704921722412
    value: -0.46538278460502625
    value: 0.069135755300521851
    value: -0.1534513533115387
    value: 0.80318659543991089
    value: 0.47361835837364197
    value: 0.83816033601760864
    value: -0.085578113794326782
    value: 0.066329874098300934
    value: -0.060985490679740906
    value: -0.24787613749504089
    value: 0.11557438224554062
    value: 0.70884203910827637
    value: 0.38334923982620239
    value: -0.25118756294250488
    value: -0.27447852492332458
    value: 0.11897355318069458
    value: -0.29576301574707031
    value: -0.07587820291519165
    value: 0.52966874837875366
    value: -0.21771818399429321
    value: -0.98705810308456421
    value: 0.44678589701652527
    value: 0.1754269003868103
    value: 0.41613376140594482
    value: -0.42859640717506409
    value: 0.32340055704116821
    value: 0.091772966086864471
    value: 3.2944371700286865
    value: 0.84513771533966064
    value: -0.079402156174182892
    value: -0.062619194388389587
    value: 0.64175158739089966
    value: -0.14787957072257996
    value: 0.17891792953014374
    value: 0.081210613250732422
    value: 0.63348013162612915
    value: 0.34541252255439758
    value: 0.235293447971344
    value: -0.7298627495765686
    value: -0.30436164140701294
    value: 0.0094468789175152779
    value: -0.17996636033058167
    value: 0.21157786250114441
    value: 0.031854230910539627
  }
}
layers {
  layer_name: "28"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 9.12038
    size: 1
    element_type: 0
    scale: 18.206409454345703
    zero_point: 0
  }
}
layers {
  layer_name: "30"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 9.69154072
    size: 1
    element_type: 1
    scale: 26.311605453491211
    zero_point: 4294967168
  }
  weights {
    min: -0.953986704
    max: 1.27496791
    size: 1
    element_type: 0
    scale: 100.39468383789062
    zero_point: 0
  }
  bias {
    min: -3.91722727
    max: 6.29944897
    size: 64
    element_type: 0
    scale: 20.319236755371094
    zero_point: 0
    value: -0.37520217895507812
    value: 2.3064508438110352
    value: 0.66134452819824219
    value: 1.0669814348220825
    value: 0.2196875661611557
    value: -0.056326236575841904
    value: -0.79185628890991211
    value: 0.34542855620384216
    value: -3.5909759998321533
    value: -0.596799910068512
    value: 3.709592342376709
    value: -0.43099397420883179
    value: 1.2277884483337402
    value: 1.4414277076721191
    value: 1.9352655410766602
    value: -0.40981253981590271
    value: 0.92464238405227661
    value: 1.1967811584472656
    value: -1.1692969799041748
    value: 0.52450007200241089
    value: 0.83383619785308838
    value: -2.293616771697998
    value: -0.44510540366172791
    value: 1.277398943901062
    value: 0.0866527184844017
    value: 0.18034222722053528
    value: 2.030184268951416
    value: 2.1766149997711182
    value: 0.90153849124908447
    value: 0.36994737386703491
    value: 2.365776538848877
    value: 6.2994489669799805
    value: -3.546133279800415
    value: 2.94209361076355
    value: -3.9172272682189941
    value: -0.57688820362091064
    value: -0.75181877613067627
    value: 3.7434539794921875
    value: -1.0622636079788208
    value: 0.39750248193740845
    value: -0.87632894515991211
    value: 0.33339327573776245
    value: 2.0548734664916992
    value: 1.1094725131988525
    value: 0.93064945936203
    value: 0.92109411954879761
    value: 0.21526883542537689
    value: -1.4935483932495117
    value: 2.1920497417449951
    value: 3.9098012447357178
    value: -2.3153183460235596
    value: 2.117222785949707
    value: -2.1477627754211426
    value: 4.6692004203796387
    value: -2.6629552841186523
    value: -0.039412748068571091
    value: 0.62312883138656616
    value: 0.9846990704536438
    value: 4.9019098281860352
    value: 3.1211183071136475
    value: 4.4051837921142578
    value: 2.3963265419006348
    value: 2.9077239036560059
    value: -0.46408143639564514
  }
}
layers {
  layer_name: "32"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 8.59373379
    size: 1
    element_type: 0
    scale: 29.672782897949219
    zero_point: 0
  }
  weights {
    min: -0.420215756
    max: 0.495761633
    size: 1
    element_type: 0
    scale: 258.1885986328125
    zero_point: 0
  }
  bias {
    min: -1.28070486
    max: 1.99501657
    size: 64
    element_type: 0
    scale: 64.159866333007812
    zero_point: 0
    value: 1.6241048574447632
    value: 0.44769948720932007
    value: 0.30215629935264587
    value: -0.053092151880264282
    value: 0.013096366077661514
    value: 0.96710163354873657
    value: 0.36083734035491943
    value: -1.2807048559188843
    value: 0.512100338935852
    value: 0.59688407182693481
    value: 1.5470840930938721
    value: 0.92952597141265869
    value: 0.29380407929420471
    value: 0.32579120993614197
    value: -0.0042348112910985947
    value: 1.3019465208053589
    value: 0.45310601592063904
    value: 0.35253450274467468
    value: 0.58073526620864868
    value: 0.64239048957824707
    value: -0.23295384645462036
    value: 0.842257022857666
    value: 0.30932539701461792
    value: 0.43875455856323242
    value: 0.35176855325698853
    value: 0.5684773325920105
    value: 0.19418078660964966
    value: 0.85784900188446045
    value: 0.29113727807998657
    value: 0.99310213327407837
    value: 0.035480782389640808
    value: 1.2135622501373291
    value: 0.390737920999527
    value: -0.9158661961555481
    value: 0.29787757992744446
    value: 1.1251739263534546
    value: 0.27915042638778687
    value: 0.29661622643470764
    value: 0.36724722385406494
    value: 0.66894841194152832
    value: 0.4954850971698761
    value: 0.48945307731628418
    value: 0.894277811050415
    value: 0.32481187582015991
    value: 0.16315688192844391
    value: 0.77019590139389038
    value: 0.333543062210083
    value: 1.9950165748596191
    value: 0.0682520717382431
    value: 0.10212980210781097
    value: -0.45790344476699829
    value: 0.266889750957489
    value: 0.41934099793434143
    value: -0.71639043092727661
    value: 0.96603769063949585
    value: 0.56537681818008423
    value: 0.76123678684234619
    value: 0.5841328501701355
    value: 0.10588191449642181
    value: 0.2863118052482605
    value: 0.11975836753845215
    value: 0.37485840916633606
    value: 0.63252747058868408
    value: 0.29166075587272644
  }
}
layers {
  layer_name: "33"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 12.5146313
    size: 1
    element_type: 0
    scale: 18.206409454345703
    zero_point: 0
  }
}
layers {
  layer_name: "35"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 8.35628796
    size: 1
    element_type: 1
    scale: 30.515941619873047
    zero_point: 4294967168
  }
  weights {
    min: -0.989107966
    max: 0.943301618
    size: 1
    element_type: 0
    scale: 129.40953063964844
    zero_point: 0
  }
  bias {
    min: -2.70666242
    max: 3.3434968
    size: 64
    element_type: 0
    scale: 38.283271789550781
    zero_point: 0
    value: -0.92216348648071289
    value: 2.1183185577392578
    value: 0.89246112108230591
    value: -0.33406978845596313
    value: 2.437631368637085
    value: -1.6286317110061646
    value: 1.0388822555541992
    value: 1.5117758512496948
    value: 0.66075515747070312
    value: -0.46114125847816467
    value: 0.66998487710952759
    value: -0.0059216702356934547
    value: 1.549077033996582
    value: -0.19517810642719269
    value: 0.80636632442474365
    value: 1.799014687538147
    value: -0.39008557796478271
    value: 2.2317698001861572
    value: 2.2539610862731934
    value: 2.465423583984375
    value: -1.0055162906646729
    value: -1.6916347742080688
    value: 2.1542894840240479
    value: -2.2972893714904785
    value: -1.0669114589691162
    value: 1.2927402257919312
    value: 1.2574561834335327
    value: -0.55684918165206909
    value: 0.76380503177642822
    value: 1.5567107200622559
    value: 0.1234210729598999
    value: -0.23260423541069031
    value: -0.42253082990646362
    value: 1.0350461006164551
    value: -0.271979957818985
    value: -1.8309009075164795
    value: 2.7722122669219971
    value: -1.3813537359237671
    value: -0.76853400468826294
    value: 0.74399298429489136
    value: 1.9101129770278931
    value: -0.080011464655399323
    value: -2.70666241645813
    value: 1.4411683082580566
    value: -0.36793878674507141
    value: 0.52944672107696533
    value: 1.5980120897293091
    value: -1.1169434785842896
    value: 1.4563752412796021
    value: -0.77261191606521606
    value: 1.8070836067199707
    value: 3.3434967994689941
    value: 1.3518471717834473
    value: -0.67431753873825073
    value: 0.024816252291202545
    value: 3.0688562393188477
    value: 2.6729371547698975
    value: -2.6447155475616455
    value: -0.14036443829536438
    value: 3.2223305702209473
    value: -2.1320161819458008
    value: 0.28448846936225891
    value: 1.0326162576675415
    value: 1.5272117853164673
  }
}
layers {
  layer_name: "37"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 12.4593897
    size: 1
    element_type: 0
    scale: 20.46649169921875
    zero_point: 0
  }
  weights {
    min: -0.914468646
    max: 0.895790875
    size: 1
    element_type: 0
    scale: 139.97200012207031
    zero_point: 0
  }
  bias {
    min: -2.29532647
    max: 7.48826122
    size: 64
    element_type: 0
    scale: 17.093420028686523
    zero_point: 0
    value: -0.3447507917881012
    value: -0.86862087249755859
    value: 0.51637363433837891
    value: 1.6812342405319214
    value: -0.42126509547233582
    value: 2.8810617923736572
    value: 0.99702215194702148
    value: 0.668695330619812
    value: 3.1748545169830322
    value: -0.083457395434379578
    value: -0.76568007469177246
    value: 1.4395042657852173
    value: 1.5489047765731812
    value: 0.86404633522033691
    value: 0.48881971836090088
    value: 0.79278117418289185
    value: 1.3238409757614136
    value: 0.73388099670410156
    value: 0.32697150111198425
    value: 0.31217542290687561
    value: 0.024890337139368057
    value: -0.85501039028167725
    value: 1.5824959278106689
    value: -0.56357961893081665
    value: 0.65551507472991943
    value: 2.4392967224121094
    value: 0.11538062989711761
    value: 3.7990052700042725
    value: 0.61390680074691772
    value: 0.33837080001831055
    value: 1.3391811847686768
    value: 0.373045414686203
    value: 0.52066898345947266
    value: 0.95657795667648315
    value: 0.10564043372869492
    value: 0.06154034286737442
    value: 1.0029757022857666
    value: 0.064426548779010773
    value: 0.72771745920181274
    value: 1.6851615905761719
    value: 0.34561803936958313
    value: 0.048941634595394135
    value: 0.045090202242136
    value: 0.93217682838439941
    value: 0.033718910068273544
    value: 7.4882612228393555
    value: 2.2282969951629639
    value: 1.4628407955169678
    value: 0.6081850528717041
    value: 1.0070341825485229
    value: 0.19860191643238068
    value: 0.070998884737491608
    value: -0.91648656129837036
    value: -1.2387039661407471
    value: 0.68221473693847656
    value: 0.85170799493789673
    value: -0.10591107606887817
    value: 0.19071592390537262
    value: -2.2953264713287354
    value: -1.9105430841445923
    value: 0.897999107837677
    value: 2.4924247264862061
    value: 1.8422502279281616
    value: 0.63798052072525024
  }
}
layers {
  layer_name: "38"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 17.9066811
    size: 1
    element_type: 0
    scale: 9.1032047271728516
    zero_point: 0
  }
}
layers {
  layer_name: "39"
  layer_type: "TIDL_ConcatLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 18.120491
    size: 1
    element_type: 0
    scale: 9.1032047271728516
    zero_point: 0
  }
}
layers {
  layer_name: "41"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 11.2497549
    size: 1
    element_type: 0
    scale: 22.667160034179688
    zero_point: 0
  }
  weights {
    min: -0.670669615
    max: 0.706145465
    size: 1
    element_type: 0
    scale: 181.26576232910156
    zero_point: 0
  }
  bias {
    min: -3.5102036
    max: 3.19782853
    size: 128
    element_type: 0
    scale: 36.465122222900391
    zero_point: 0
    value: -0.040990222245454788
    value: -0.10473779588937759
    value: 1.119093656539917
    value: 0.94435751438140869
    value: 0.040386497974395752
    value: 0.9047619104385376
    value: 1.2483623027801514
    value: 0.73161530494689941
    value: -2.3267641067504883
    value: 0.98921120166778564
    value: -0.52870440483093262
    value: -1.3304877281188965
    value: 1.2752121686935425
    value: -2.3126828670501709
    value: 1.5519737005233765
    value: 0.66887438297271729
    value: 1.3197808265686035
    value: -1.1205470561981201
    value: -0.851481556892395
    value: 0.946688711643219
    value: 0.747678279876709
    value: 0.58188825845718384
    value: 1.6072444915771484
    value: 2.1171708106994629
    value: -0.31664827466011047
    value: -0.2656978964805603
    value: -0.02450241893529892
    value: 2.7718138694763184
    value: -0.71343731880187988
    value: 0.99518495798110962
    value: -0.22027720510959625
    value: 1.4223374128341675
    value: 2.1105406284332275
    value: 0.36208003759384155
    value: -1.7576777935028076
    value: 0.0097450157627463341
    value: 1.4785113334655762
    value: 0.82351946830749512
    value: 1.1267688274383545
    value: -0.079720519483089447
    value: -0.74459290504455566
    value: 0.22878378629684448
    value: -3.0256755352020264
    value: -0.913158118724823
    value: 1.6992635726928711
    value: 0.068311840295791626
    value: 1.4328340291976929
    value: 0.14792989194393158
    value: 1.0745983123779297
    value: -0.37723052501678467
    value: 1.0339101552963257
    value: -1.7943013906478882
    value: -0.89273571968078613
    value: -0.73855555057525635
    value: 0.68338257074356079
    value: -0.17125628888607025
    value: -0.11815359443426132
    value: 1.2736387252807617
    value: 0.56744509935379028
    value: 0.98542064428329468
    value: -1.2696448564529419
    value: -0.16440336406230927
    value: 1.9461332559585571
    value: -1.3243099451065063
    value: -1.4786027669906616
    value: 0.077027007937431335
    value: -0.25890809297561646
    value: 1.6890871524810791
    value: 1.1776566505432129
    value: 0.24638938903808594
    value: 0.75690323114395142
    value: -0.52781140804290771
    value: 2.0820190906524658
    value: -0.41193085908889771
    value: 0.77478271722793579
    value: -1.6904740333557129
    value: -0.85709136724472046
    value: 0.29130348563194275
    value: 0.098664425313472748
    value: 1.0886766910552979
    value: -1.8062441349029541
    value: -1.2758274078369141
    value: -2.1455307006835938
    value: 0.68969440460205078
    value: -0.34917664527893066
    value: 1.4920684099197388
    value: 1.3874870538711548
    value: -0.23693625628948212
    value: -0.28683385252952576
    value: -1.3929014205932617
    value: 1.358185887336731
    value: 0.02752232737839222
    value: 0.53903359174728394
    value: 2.1610243320465088
    value: 0.088021010160446167
    value: -0.85051971673965454
    value: 0.627314567565918
    value: -1.4147144556045532
    value: -0.82667696475982666
    value: -0.88284105062484741
    value: 0.087040618062019348
    value: 0.264404833316803
    value: 0.70506799221038818
    value: 3.1978285312652588
    value: -1.3988467454910278
    value: -0.7192876935005188
    value: -0.29916593432426453
    value: 2.6093626022338867
    value: -0.19165067374706268
    value: 1.38600754737854
    value: 0.10897244513034821
    value: 0.27483025193214417
    value: 0.58829480409622192
    value: -0.43795379996299744
    value: -0.49662202596664429
    value: -0.12287389487028122
    value: 0.81881630420684814
    value: 0.049024883657693863
    value: 0.61252975463867188
    value: -0.40716144442558289
    value: -1.820076584815979
    value: 0.66118937730789185
    value: 0.79277819395065308
    value: 0.40878778696060181
    value: -3.5102035999298096
    value: -0.64647364616394043
    value: -0.038463763892650604
    value: 0.28990298509597778
  }
}
layers {
  layer_name: "43"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 11.3346596
    size: 1
    element_type: 1
    scale: 22.497367858886719
    zero_point: 4294967168
  }
  weights {
    min: -0.679412246
    max: 0.597038507
    size: 1
    element_type: 0
    scale: 188.39813232421875
    zero_point: 0
  }
  bias {
    min: -2.12766361
    max: 2.2261405
    size: 256
    element_type: 0
    scale: 57.498615264892578
    zero_point: 0
    value: -0.50046455860137939
    value: 1.2198907136917114
    value: 0.033201891928911209
    value: -1.0408611297607422
    value: -0.77983790636062622
    value: -0.58766597509384155
    value: 0.15771001577377319
    value: -1.1801499128341675
    value: 1.3518837690353394
    value: -0.57755297422409058
    value: 0.013139320537447929
    value: 0.057542093098163605
    value: -0.06014704704284668
    value: -0.21339000761508942
    value: -0.65466612577438354
    value: -0.43216902017593384
    value: -0.26488718390464783
    value: -0.23662807047367096
    value: -0.38884174823760986
    value: -0.2371889054775238
    value: 0.1884751170873642
    value: 0.56025362014770508
    value: -0.29477775096893311
    value: 0.005492381751537323
    value: 0.28431054949760437
    value: 0.94139128923416138
    value: -0.087737776339054108
    value: -0.78721112012863159
    value: -0.1702495813369751
    value: -0.796039342880249
    value: -0.17080096900463104
    value: -0.7151339054107666
    value: -1.1801371574401855
    value: 0.37036356329917908
    value: 0.49162966012954712
    value: -0.27029290795326233
    value: -0.11401931196451187
    value: 0.89333361387252808
    value: -1.0434780120849609
    value: -1.013799786567688
    value: 0.10166146606206894
    value: 0.13056473433971405
    value: 0.4570879340171814
    value: -0.630232572555542
    value: 0.35780087113380432
    value: 0.4353393018245697
    value: -1.7857911586761475
    value: -0.1722005307674408
    value: -0.26396811008453369
    value: 0.86503559350967407
    value: 0.027386484667658806
    value: -0.3836732804775238
    value: 0.69393163919448853
    value: -0.45639729499816895
    value: 0.41016724705696106
    value: -0.79713523387908936
    value: -0.39258989691734314
    value: -0.17524294555187225
    value: -1.5008211135864258
    value: -0.19430145621299744
    value: -0.51171165704727173
    value: 0.76213288307189941
    value: -0.48797842860221863
    value: -0.70868992805480957
    value: -0.19730770587921143
    value: 0.0342366024851799
    value: 0.18237563967704773
    value: -0.049914229661226273
    value: -0.5087088942527771
    value: -1.2854984998703003
    value: -0.66671246290206909
    value: -0.69288629293441772
    value: -0.79902458190917969
    value: -0.15197339653968811
    value: 0.56945931911468506
    value: 0.22616416215896606
    value: 0.16319884359836578
    value: 0.52365255355834961
    value: 1.3298143148422241
    value: 0.54351180791854858
    value: 0.11011312901973724
    value: 0.061461355537176132
    value: 2.2261404991149902
    value: 0.065142728388309479
    value: -0.35882246494293213
    value: -0.013661997392773628
    value: 0.15132942795753479
    value: -0.15029339492321014
    value: -0.65383332967758179
    value: -0.13635994493961334
    value: -0.44916075468063354
    value: 1.4918872117996216
    value: -1.1559324264526367
    value: -0.54955887794494629
    value: -0.50570982694625854
    value: 1.6371967792510986
    value: 0.22153261303901672
    value: 0.743499219417572
    value: 0.78917783498764038
    value: -0.099425189197063446
    value: 0.72022950649261475
    value: -0.31644898653030396
    value: 2.0917680263519287
    value: 0.97926288843154907
    value: 0.992406964302063
    value: -1.609408974647522
    value: -0.15410724282264709
    value: -1.1281572580337524
    value: 0.07886572927236557
    value: -0.1811116635799408
    value: -0.280477911233902
    value: -0.50525355339050293
    value: -0.15251831710338593
    value: 0.77217787504196167
    value: 0.85449296236038208
    value: -0.62998038530349731
    value: 0.59122449159622192
    value: -0.71692544221878052
    value: -0.61382955312728882
    value: -0.20191493630409241
    value: -0.72940963506698608
    value: 0.74266576766967773
    value: 0.74450361728668213
    value: 0.49591153860092163
    value: 0.23654152452945709
    value: 1.1104590892791748
    value: 0.47309911251068115
    value: 1.9827899932861328
    value: -1.4468625783920288
    value: -0.46183350682258606
    value: -0.57134169340133667
    value: -0.36718529462814331
    value: -1.2213598489761353
    value: -0.46385672688484192
    value: -0.0157181266695261
    value: -0.363040030002594
    value: -0.35786876082420349
    value: -0.5565682053565979
    value: 0.24198445677757263
    value: -0.22158768773078918
    value: 0.16936220228672028
    value: -0.032319337129592896
    value: -0.30364570021629333
    value: -0.50442755222320557
    value: 0.15677256882190704
    value: 0.98332947492599487
    value: 0.060861486941576004
    value: -0.079116135835647583
    value: 0.041083503514528275
    value: 0.012514657340943813
    value: -0.73261243104934692
    value: -0.27914819121360779
    value: -0.55227875709533691
    value: -0.24519596993923187
    value: -1.0146476030349731
    value: 1.4075123071670532
    value: -0.59635502099990845
    value: 0.17150393128395081
    value: 0.42636430263519287
    value: 0.67813891172409058
    value: 0.091987021267414093
    value: -0.38407522439956665
    value: 0.7933427095413208
    value: -0.50618404150009155
    value: -1.3253706693649292
    value: 0.58627086877822876
    value: 0.13414262235164642
    value: -0.59730380773544312
    value: 0.31071853637695312
    value: 0.26397913694381714
    value: 0.67747646570205688
    value: 0.16631516814231873
    value: -0.23140060901641846
    value: -0.00081479921936988831
    value: 0.24868588149547577
    value: -0.36579877138137817
    value: 0.49780866503715515
    value: 1.1589666604995728
    value: -0.60102683305740356
    value: -1.1140495538711548
    value: 0.53286623954772949
    value: 0.13516782224178314
    value: -0.10778991878032684
    value: -0.87691336870193481
    value: -0.814740777015686
    value: 0.94350045919418335
    value: -0.5421595573425293
    value: -0.14079068601131439
    value: -0.44781225919723511
    value: 0.7864995002746582
    value: -0.19238722324371338
    value: 0.10112474113702774
    value: -1.020841121673584
    value: -1.5396085977554321
    value: 0.12840646505355835
    value: -0.671534538269043
